<!-- attach-outputs:plan-nodes-prod.txt -->
  <!-- Output: plan-nodes-prod.txt -->
  #### plan-nodes-prod.txt 📖: `test: success, prod: success`

  **Last updated:** Dec 7, 2025, 09:35 PM UTC

  <details><summary>Show Contents</summary>

  ```

  
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # proxmox_virtual_environment_download_file.talos_iso["nuc-g2p-1"] will be created
  + resource "proxmox_virtual_environment_download_file" "talos_iso" {
      + content_type        = "iso"
      + datastore_id        = "local"
      + file_name           = (known after apply)
      + id                  = (known after apply)
      + node_name           = "nuc-g2p-1"
      + overwrite           = true
      + overwrite_unmanaged = false
      + size                = (known after apply)
      + upload_timeout      = 600
      + url                 = (known after apply)
      + verify              = true
    }

  # proxmox_virtual_environment_download_file.talos_iso["nuc-g2p-2"] will be created
  + resource "proxmox_virtual_environment_download_file" "talos_iso" {
      + content_type        = "iso"
      + datastore_id        = "local"
      + file_name           = (known after apply)
      + id                  = (known after apply)
      + node_name           = "nuc-g2p-2"
      + overwrite           = true
      + overwrite_unmanaged = false
      + size                = (known after apply)
      + upload_timeout      = 600
      + url                 = (known after apply)
      + verify              = true
    }

  # proxmox_virtual_environment_download_file.talos_iso["nuc-g3p-1"] will be created
  + resource "proxmox_virtual_environment_download_file" "talos_iso" {
      + content_type        = "iso"
      + datastore_id        = "local"
      + file_name           = (known after apply)
      + id                  = (known after apply)
      + node_name           = "nuc-g3p-1"
      + overwrite           = true
      + overwrite_unmanaged = false
      + size                = (known after apply)
      + upload_timeout      = 600
      + url                 = (known after apply)
      + verify              = true
    }

  # proxmox_virtual_environment_download_file.talos_iso["nuc-g3p-2"] will be created
  + resource "proxmox_virtual_environment_download_file" "talos_iso" {
      + content_type        = "iso"
      + datastore_id        = "local"
      + file_name           = (known after apply)
      + id                  = (known after apply)
      + node_name           = "nuc-g3p-2"
      + overwrite           = true
      + overwrite_unmanaged = false
      + size                = (known after apply)
      + upload_timeout      = 600
      + url                 = (known after apply)
      + verify              = true
    }

  # talos_image_factory_schematic.this will be created
  + resource "talos_image_factory_schematic" "this" {
      + id        = (known after apply)
      + schematic = <<-EOT
            "customization":
              "extraKernelArgs":
              - "vga=792"
              - "-talos.halt_if_installed"
              "systemExtensions":
                "officialExtensions":
                - "siderolabs/qemu-guest-agent"
        EOT
    }

  # module.cluster.data.talos_client_configuration.talosconfig will be read during apply
  # (config refers to values not yet known)
 <= data "talos_client_configuration" "talosconfig" {
      + client_configuration = (known after apply)
      + cluster_name         = "tiles-test"
      + endpoints            = [
          + "10.0.192.11",
        ]
      + id                   = (known after apply)
      + talos_config         = (sensitive value)
    }

  # module.cluster.data.talos_machine_configuration.machineconfig_cp will be read during apply
  # (config refers to values not yet known)
 <= data "talos_machine_configuration" "machineconfig_cp" {
      + cluster_endpoint      = "https://10.0.192.10:6443"
      + cluster_name          = "tiles-test"
      + config_patches        = [
          + <<-EOT
                # This is modified with dynamic values in main.tf
                # Following https://docs.cilium.io/en/v1.16/installation/k8s-install-helm/
                cluster:
                  network:
                    # cilium will become our CNI.
                    cni:
                      name: none
                  controllerManager:
                    extraArgs:
                      # Listen to more than localhost so we can scrape from Alloy.
                      bind-address: 0.0.0.0
                  scheduler:
                    extraArgs:
                      # Listen to more than localhost so we can scrape from Alloy.
                      bind-address: 0.0.0.0
                  apiServer:
                    extraArgs:
                      # Listen to more than localhost so we can scrape from Alloy.
                      bind-address: 0.0.0.0
                
                  proxy:
                    # Cilium will replace the proxy
                    disabled: true
                machine:
                  sysctls:
                    user.max_user_namespaces: "8192"
                  # https://www.talos.dev/v1.10/talos-guides/configuration/containerd/#exposing-metrics
                  files:
                    - content: |
                        [metrics]
                          address = "0.0.0.0:11234"
                      path: /etc/cri/conf.d/20-customization.part
                      op: create
                  features:
                    rbac: true
                    diskQuotaSupport: true
                    hostDNS:
                      enabled: true
                      resolveMemberNames: true
                      forwardKubeDNSToHost: false
                    imageCache:
                      localEnabled: true
                  install:
                    # wipe: true
                    extraKernelArgs:
                      # 1024x768 for the dashboard:
                      - vga=792
                      - -talos.halt_if_installed
            EOT,
          + (known after apply),
          + <<-EOT
                "machine":
                  "network":
                    "interfaces":
                    - "deviceSelector":
                        "physical": true
                      "dhcp": true
                      "vip":
                        "ip": "10.0.192.10"
            EOT,
        ]
      + id                    = (known after apply)
      + machine_configuration = (sensitive value)
      + machine_secrets       = (known after apply)
      + machine_type          = "controlplane"
    }

  # module.cluster.data.talos_machine_configuration.machineconfig_worker will be read during apply
  # (config refers to values not yet known)
 <= data "talos_machine_configuration" "machineconfig_worker" {
      + cluster_endpoint      = "https://10.0.192.10:6443"
      + cluster_name          = "tiles-test"
      + config_patches        = [
          + <<-EOT
                # This is modified with dynamic values in main.tf
                # Following https://docs.cilium.io/en/v1.16/installation/k8s-install-helm/
                cluster:
                  network:
                    # cilium will become our CNI.
                    cni:
                      name: none
                  controllerManager:
                    extraArgs:
                      # Listen to more than localhost so we can scrape from Alloy.
                      bind-address: 0.0.0.0
                  scheduler:
                    extraArgs:
                      # Listen to more than localhost so we can scrape from Alloy.
                      bind-address: 0.0.0.0
                  apiServer:
                    extraArgs:
                      # Listen to more than localhost so we can scrape from Alloy.
                      bind-address: 0.0.0.0
                
                  proxy:
                    # Cilium will replace the proxy
                    disabled: true
                machine:
                  sysctls:
                    user.max_user_namespaces: "8192"
                  # https://www.talos.dev/v1.10/talos-guides/configuration/containerd/#exposing-metrics
                  files:
                    - content: |
                        [metrics]
                          address = "0.0.0.0:11234"
                      path: /etc/cri/conf.d/20-customization.part
                      op: create
                  features:
                    rbac: true
                    diskQuotaSupport: true
                    hostDNS:
                      enabled: true
                      resolveMemberNames: true
                      forwardKubeDNSToHost: false
                    imageCache:
                      localEnabled: true
                  install:
                    # wipe: true
                    extraKernelArgs:
                      # 1024x768 for the dashboard:
                      - vga=792
                      - -talos.halt_if_installed
            EOT,
          + (known after apply),
        ]
      + id                    = (known after apply)
      + machine_configuration = (sensitive value)
      + machine_secrets       = (known after apply)
      + machine_type          = "worker"
    }

  # module.cluster.onepassword_item.kubeconfig[0] will be created
  + resource "onepassword_item" "kubeconfig" {
      + category   = "secure_note"
      + id         = (known after apply)
      + note_value = (sensitive value)
      + password   = (sensitive value)
      + title      = "tiles-test-kubeconfig"
      + uuid       = (known after apply)
      + vault      = "lyyqeg3pe6dvqdeb5hbiu7b76y"

      + section {
          + id    = (known after apply)
          + label = "metadata"

          + field {
              + id    = (known after apply)
              + label = "source"
              + type  = "STRING"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = "root_module"
              + type  = "STRING"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = "module"
              + type  = "STRING"
              + value = (sensitive value)
            }
        }
    }

  # module.cluster.onepassword_item.machine_secrets[0] will be created
  + resource "onepassword_item" "machine_secrets" {
      + category   = "secure_note"
      + id         = (known after apply)
      + note_value = (sensitive value)
      + password   = (sensitive value)
      + title      = "tiles-test-machine-secrets"
      + uuid       = (known after apply)
      + vault      = "lyyqeg3pe6dvqdeb5hbiu7b76y"

      + section {
          + id    = (known after apply)
          + label = "metadata"

          + field {
              + id    = (known after apply)
              + label = "source"
              + type  = "STRING"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = "root_module"
              + type  = "STRING"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = "module"
              + type  = "STRING"
              + value = (sensitive value)
            }
        }
    }

  # module.cluster.onepassword_item.misc_config[0] will be created
  + resource "onepassword_item" "misc_config" {
      + category = "secure_note"
      + id       = (known after apply)
      + password = (sensitive value)
      + title    = "tiles-test-misc-config"
      + uuid     = (known after apply)
      + vault    = "lyyqeg3pe6dvqdeb5hbiu7b76y"

      + section {
          + id    = (known after apply)
          + label = "config"

          + field {
              + id    = (known after apply)
              + label = "pod_cidr"
              + type  = "STRING"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = "targetRevision"
              + type  = "STRING"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = "cluster_name"
              + type  = "STRING"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = "external_ip_cidr"
              + type  = "STRING"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = "vault_name"
              + type  = "STRING"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = "loki_bucket_chunks"
              + type  = "STRING"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = "loki_bucket_ruler"
              + type  = "STRING"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = "loki_bucket_admin"
              + type  = "STRING"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = "mimir_bucket_blocks"
              + type  = "STRING"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = "mimir_bucket_ruler"
              + type  = "STRING"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = "mimir_bucket_alertmanager"
              + type  = "STRING"
              + value = (sensitive value)
            }
        }
      + section {
          + id    = (known after apply)
          + label = "metadata"

          + field {
              + id    = (known after apply)
              + label = "source"
              + type  = "STRING"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = "root_module"
              + type  = "STRING"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = "module"
              + type  = "STRING"
              + value = (sensitive value)
            }
        }
    }

  # module.cluster.onepassword_item.talosconfig[0] will be created
  + resource "onepassword_item" "talosconfig" {
      + category   = "secure_note"
      + id         = (known after apply)
      + note_value = (sensitive value)
      + password   = (sensitive value)
      + title      = "tiles-test-talosconfig"
      + uuid       = (known after apply)
      + vault      = "lyyqeg3pe6dvqdeb5hbiu7b76y"

      + section {
          + id    = (known after apply)
          + label = "metadata"

          + field {
              + id    = (known after apply)
              + label = "source"
              + type  = "STRING"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = "root_module"
              + type  = "STRING"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = "module"
              + type  = "STRING"
              + value = (sensitive value)
            }
        }
    }

  # module.cluster.talos_cluster_kubeconfig.this[0] will be created
  + resource "talos_cluster_kubeconfig" "this" {
      + certificate_renewal_duration    = "720h"
      + client_configuration            = (known after apply)
      + endpoint                        = "10.0.192.11"
      + id                              = (known after apply)
      + kubeconfig_raw                  = (sensitive value)
      + kubernetes_client_configuration = (known after apply)
      + node                            = "10.0.192.11"
    }

  # module.cluster.talos_machine_bootstrap.this[0] will be created
  + resource "talos_machine_bootstrap" "this" {
      + client_configuration = (known after apply)
      + endpoint             = "10.0.192.11"
      + id                   = (known after apply)
      + node                 = "10.0.192.11"
    }

  # module.cluster.talos_machine_secrets.this will be created
  + resource "talos_machine_secrets" "this" {
      + client_configuration = (known after apply)
      + id                   = (known after apply)
      + machine_secrets      = (known after apply)
      + talos_version        = "v1.11"
    }

  # module.cluster.module.k8s.cloudflare_dns_record.delegation[0] will be created
  + resource "cloudflare_dns_record" "delegation" {
      + comment             = "Managed by Terraform"
      + comment_modified_on = (known after apply)
      + content             = (known after apply)
      + created_on          = (known after apply)
      + id                  = (known after apply)
      + meta                = (known after apply)
      + modified_on         = (known after apply)
      + name                = "tiles-test"
      + proxiable           = (known after apply)
      + proxied             = false
      + settings            = (known after apply)
      + tags                = (known after apply)
      + tags_modified_on    = (known after apply)
      + ttl                 = 300
      + type                = "NS"
      + zone_id             = "73b4d912118a49df40acea58c4983678"
    }

  # module.cluster.module.k8s.cloudflare_dns_record.delegation[1] will be created
  + resource "cloudflare_dns_record" "delegation" {
      + comment             = "Managed by Terraform"
      + comment_modified_on = (known after apply)
      + content             = (known after apply)
      + created_on          = (known after apply)
      + id                  = (known after apply)
      + meta                = (known after apply)
      + modified_on         = (known after apply)
      + name                = "tiles-test"
      + proxiable           = (known after apply)
      + proxied             = false
      + settings            = (known after apply)
      + tags                = (known after apply)
      + tags_modified_on    = (known after apply)
      + ttl                 = 300
      + type                = "NS"
      + zone_id             = "73b4d912118a49df40acea58c4983678"
    }

  # module.cluster.module.k8s.cloudflare_dns_record.delegation[2] will be created
  + resource "cloudflare_dns_record" "delegation" {
      + comment             = "Managed by Terraform"
      + comment_modified_on = (known after apply)
      + content             = (known after apply)
      + created_on          = (known after apply)
      + id                  = (known after apply)
      + meta                = (known after apply)
      + modified_on         = (known after apply)
      + name                = "tiles-test"
      + proxiable           = (known after apply)
      + proxied             = false
      + settings            = (known after apply)
      + tags                = (known after apply)
      + tags_modified_on    = (known after apply)
      + ttl                 = 300
      + type                = "NS"
      + zone_id             = "73b4d912118a49df40acea58c4983678"
    }

  # module.cluster.module.k8s.cloudflare_dns_record.delegation[3] will be created
  + resource "cloudflare_dns_record" "delegation" {
      + comment             = "Managed by Terraform"
      + comment_modified_on = (known after apply)
      + content             = (known after apply)
      + created_on          = (known after apply)
      + id                  = (known after apply)
      + meta                = (known after apply)
      + modified_on         = (known after apply)
      + name                = "tiles-test"
      + proxiable           = (known after apply)
      + proxied             = false
      + settings            = (known after apply)
      + tags                = (known after apply)
      + tags_modified_on    = (known after apply)
      + ttl                 = 300
      + type                = "NS"
      + zone_id             = "73b4d912118a49df40acea58c4983678"
    }

  # module.cluster.module.k8s.google_dns_managed_zone_iam_member.cert_manager_dns01_public will be created
  + resource "google_dns_managed_zone_iam_member" "cert_manager_dns01_public" {
      + etag         = (known after apply)
      + id           = (known after apply)
      + managed_zone = "tiles-test"
      + member       = "serviceAccount:sa-tiles-test-cert-manager@symm-custodes.iam.gserviceaccount.com"
      + project      = "symm-custodes"
      + role         = "roles/dns.admin"
    }

  # module.cluster.module.k8s.google_dns_managed_zone_iam_member.external_dns_public will be created
  + resource "google_dns_managed_zone_iam_member" "external_dns_public" {
      + etag         = (known after apply)
      + id           = (known after apply)
      + managed_zone = "tiles-test"
      + member       = "serviceAccount:sa-tiles-test-external-dns@symm-custodes.iam.gserviceaccount.com"
      + project      = "symm-custodes"
      + role         = "roles/dns.admin"
    }

  # module.cluster.module.k8s.google_project_iam_member.cert_manager_dns01_dns_reader will be created
  + resource "google_project_iam_member" "cert_manager_dns01_dns_reader" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:sa-tiles-test-cert-manager@symm-custodes.iam.gserviceaccount.com"
      + project = "symm-custodes"
      + role    = "roles/dns.reader"
    }

  # module.cluster.module.k8s.google_project_iam_member.external_dns_dns_reader will be created
  + resource "google_project_iam_member" "external_dns_dns_reader" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:sa-tiles-test-external-dns@symm-custodes.iam.gserviceaccount.com"
      + project = "symm-custodes"
      + role    = "roles/dns.reader"
    }

  # module.cluster.module.k8s.google_service_account.cert_manager_dns01 will be created
  + resource "google_service_account" "cert_manager_dns01" {
      + account_id   = "sa-tiles-test-cert-manager"
      + description  = "Service account for tiles-test cert-manager to perform DNS01 ACME challenges"
      + disabled     = false
      + display_name = "tiles-test cert-manager DNS01 Solver"
      + email        = "sa-tiles-test-cert-manager@symm-custodes.iam.gserviceaccount.com"
      + id           = (known after apply)
      + member       = "serviceAccount:sa-tiles-test-cert-manager@symm-custodes.iam.gserviceaccount.com"
      + name         = (known after apply)
      + project      = "symm-custodes"
      + unique_id    = (known after apply)
    }

  # module.cluster.module.k8s.google_service_account.external_dns will be created
  + resource "google_service_account" "external_dns" {
      + account_id   = "sa-tiles-test-external-dns"
      + description  = "Service account for tiles-test external-dns to manage DNS records"
      + disabled     = false
      + display_name = "tiles-test external-dns"
      + email        = "sa-tiles-test-external-dns@symm-custodes.iam.gserviceaccount.com"
      + id           = (known after apply)
      + member       = "serviceAccount:sa-tiles-test-external-dns@symm-custodes.iam.gserviceaccount.com"
      + name         = (known after apply)
      + project      = "symm-custodes"
      + unique_id    = (known after apply)
    }

  # module.cluster.module.k8s.google_service_account.loki will be created
  + resource "google_service_account" "loki" {
      + account_id   = "tiles-test-loki"
      + description  = "Service account for tiles-test Loki"
      + disabled     = false
      + display_name = "tiles-test Loki Service Account"
      + email        = "tiles-test-loki@symm-custodes.iam.gserviceaccount.com"
      + id           = (known after apply)
      + member       = "serviceAccount:tiles-test-loki@symm-custodes.iam.gserviceaccount.com"
      + name         = (known after apply)
      + project      = "symm-custodes"
      + unique_id    = (known after apply)
    }

  # module.cluster.module.k8s.google_service_account.mimir will be created
  + resource "google_service_account" "mimir" {
      + account_id   = "tiles-test-mimir"
      + description  = "Service account for tiles-test Mimir"
      + disabled     = false
      + display_name = "tiles-test Mimir Service Account"
      + email        = "tiles-test-mimir@symm-custodes.iam.gserviceaccount.com"
      + id           = (known after apply)
      + member       = "serviceAccount:tiles-test-mimir@symm-custodes.iam.gserviceaccount.com"
      + name         = (known after apply)
      + project      = "symm-custodes"
      + unique_id    = (known after apply)
    }

  # module.cluster.module.k8s.google_service_account_key.cert_manager_dns01_sa_key will be created
  + resource "google_service_account_key" "cert_manager_dns01_sa_key" {
      + id                 = (known after apply)
      + key_algorithm      = "KEY_ALG_RSA_2048"
      + name               = (known after apply)
      + private_key        = (sensitive value)
      + private_key_type   = "TYPE_GOOGLE_CREDENTIALS_FILE"
      + public_key         = (known after apply)
      + public_key_type    = "TYPE_X509_PEM_FILE"
      + service_account_id = (known after apply)
      + valid_after        = (known after apply)
      + valid_before       = (known after apply)
    }

  # module.cluster.module.k8s.google_service_account_key.external_dns_sa_key will be created
  + resource "google_service_account_key" "external_dns_sa_key" {
      + id                 = (known after apply)
      + key_algorithm      = "KEY_ALG_RSA_2048"
      + name               = (known after apply)
      + private_key        = (sensitive value)
      + private_key_type   = "TYPE_GOOGLE_CREDENTIALS_FILE"
      + public_key         = (known after apply)
      + public_key_type    = "TYPE_X509_PEM_FILE"
      + service_account_id = (known after apply)
      + valid_after        = (known after apply)
      + valid_before       = (known after apply)
    }

  # module.cluster.module.k8s.google_service_account_key.loki will be created
  + resource "google_service_account_key" "loki" {
      + id                 = (known after apply)
      + key_algorithm      = "KEY_ALG_RSA_2048"
      + name               = (known after apply)
      + private_key        = (sensitive value)
      + private_key_type   = "TYPE_GOOGLE_CREDENTIALS_FILE"
      + public_key         = (known after apply)
      + public_key_type    = "TYPE_X509_PEM_FILE"
      + service_account_id = (known after apply)
      + valid_after        = (known after apply)
      + valid_before       = (known after apply)
    }

  # module.cluster.module.k8s.google_service_account_key.mimir will be created
  + resource "google_service_account_key" "mimir" {
      + id                 = (known after apply)
      + key_algorithm      = "KEY_ALG_RSA_2048"
      + name               = (known after apply)
      + private_key        = (sensitive value)
      + private_key_type   = "TYPE_GOOGLE_CREDENTIALS_FILE"
      + public_key         = (known after apply)
      + public_key_type    = "TYPE_X509_PEM_FILE"
      + service_account_id = (known after apply)
      + valid_after        = (known after apply)
      + valid_before       = (known after apply)
    }

  # module.cluster.module.k8s.htpasswd_password.loki_cluster_tenant will be created
  + resource "htpasswd_password" "loki_cluster_tenant" {
      + apr1     = (known after apply)
      + bcrypt   = (known after apply)
      + id       = (known after apply)
      + password = (sensitive value)
      + sha256   = (known after apply)
      + sha512   = (known after apply)
    }

  # module.cluster.module.k8s.onepassword_item.cert_manager_dns01_sa_key will be created
  + resource "onepassword_item" "cert_manager_dns01_sa_key" {
      + category = "secure_note"
      + id       = (known after apply)
      + password = (sensitive value)
      + title    = "tiles-test-cert-manager-dns01-sa-key"
      + uuid     = (known after apply)
      + vault    = "lyyqeg3pe6dvqdeb5hbiu7b76y"

      + section {
          + id    = (known after apply)
          + label = "credentials"

          + field {
              + id    = (known after apply)
              + label = "private_key.json"
              + type  = "CONCEALED"
              + value = (sensitive value)
            }
        }
      + section {
          + id    = (known after apply)
          + label = "metadata"

          + field {
              + id    = (known after apply)
              + label = "source"
              + type  = "STRING"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = "root_module"
              + type  = "STRING"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = "module"
              + type  = "STRING"
              + value = (sensitive value)
            }
        }
    }

  # module.cluster.module.k8s.onepassword_item.external_dns_clouddns_sa_key will be created
  + resource "onepassword_item" "external_dns_clouddns_sa_key" {
      + category = "secure_note"
      + id       = (known after apply)
      + password = (sensitive value)
      + title    = "tiles-test-external-dns-clouddns-sa-key"
      + uuid     = (known after apply)
      + vault    = "lyyqeg3pe6dvqdeb5hbiu7b76y"

      + section {
          + id    = (known after apply)
          + label = "credentials"

          + field {
              + id    = (known after apply)
              + label = "credential.json"
              + type  = "CONCEALED"
              + value = (sensitive value)
            }
        }
      + section {
          + id    = (known after apply)
          + label = "metadata"

          + field {
              + id    = (known after apply)
              + label = "source"
              + type  = "STRING"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = "root_module"
              + type  = "STRING"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = "module"
              + type  = "STRING"
              + value = (sensitive value)
            }
        }
    }

  # module.cluster.module.k8s.onepassword_item.gsa-loki will be created
  + resource "onepassword_item" "gsa-loki" {
      + category = "secure_note"
      + id       = (known after apply)
      + password = (sensitive value)
      + title    = "tiles-test-gsa-loki"
      + uuid     = (known after apply)
      + vault    = "lyyqeg3pe6dvqdeb5hbiu7b76y"

      + section {
          + id    = (known after apply)
          + label = "credentials"

          + field {
              + id    = (known after apply)
              + label = "credential.json"
              + type  = "CONCEALED"
              + value = (sensitive value)
            }
        }
      + section {
          + id    = (known after apply)
          + label = "metadata"

          + field {
              + id    = (known after apply)
              + label = "source"
              + type  = "STRING"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = "root_module"
              + type  = "STRING"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = "module"
              + type  = "STRING"
              + value = (sensitive value)
            }
        }
    }

  # module.cluster.module.k8s.onepassword_item.gsa-mimir will be created
  + resource "onepassword_item" "gsa-mimir" {
      + category = "secure_note"
      + id       = (known after apply)
      + password = (sensitive value)
      + title    = "tiles-test-gsa-mimir"
      + uuid     = (known after apply)
      + vault    = "lyyqeg3pe6dvqdeb5hbiu7b76y"

      + section {
          + id    = (known after apply)
          + label = "credentials"

          + field {
              + id    = (known after apply)
              + label = "credential.json"
              + type  = "CONCEALED"
              + value = (sensitive value)
            }
        }
      + section {
          + id    = (known after apply)
          + label = "metadata"

          + field {
              + id    = (known after apply)
              + label = "source"
              + type  = "STRING"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = "root_module"
              + type  = "STRING"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = "module"
              + type  = "STRING"
              + value = (sensitive value)
            }
        }
    }

  # module.cluster.module.k8s.onepassword_item.loki_tenant_auth_secret will be created
  + resource "onepassword_item" "loki_tenant_auth_secret" {
      + category = "secure_note"
      + id       = (known after apply)
      + password = (sensitive value)
      + title    = "tiles-test-loki-tenant-auth"
      + uuid     = (known after apply)
      + vault    = "lyyqeg3pe6dvqdeb5hbiu7b76y"

      + section {
          + id    = (known after apply)
          + label = "credentials"

          + field {
              + id    = (known after apply)
              + label = "username"
              + type  = "STRING"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = "password"
              + type  = "CONCEALED"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = ".htaccess"
              + type  = "CONCEALED"
              + value = (sensitive value)
            }
        }
      + section {
          + id    = (known after apply)
          + label = "metadata"

          + field {
              + id    = (known after apply)
              + label = "source"
              + type  = "STRING"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = "root_module"
              + type  = "STRING"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = "module"
              + type  = "STRING"
              + value = (sensitive value)
            }
        }
    }

  # module.cluster.module.k8s.random_password.loki_cluster_tenant will be created
  + resource "random_password" "loki_cluster_tenant" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 24
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = true
      + upper       = true
    }

  # module.cluster.module.talos-vm["tiles-test-cp"].proxmox_virtual_environment_vm.main will be created
  + resource "proxmox_virtual_environment_vm" "main" {
      + acpi                                 = true
      + bios                                 = "seabios"
      + boot_order                           = (known after apply)
      + delete_unreferenced_disks_on_destroy = true
      + description                          = "Control - 7411 - tiles-test-cp - 10.0.192.11"
      + id                                   = (known after apply)
      + ipv4_addresses                       = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + keyboard_layout                      = "en-us"
      + mac_addresses                        = (known after apply)
      + migrate                              = false
      + name                                 = "tiles-test-cp"
      + network_interface_names              = (known after apply)
      + node_name                            = "nuc-g3p-2"
      + on_boot                              = true
      + protection                           = false
      + purge_on_destroy                     = true
      + reboot                               = false
      + reboot_after_update                  = true
      + scsi_hardware                        = "virtio-scsi-single"
      + started                              = true
      + stop_on_destroy                      = false
      + tablet_device                        = true
      + tags                                 = []
      + template                             = false
      + timeout_clone                        = 1800
      + timeout_create                       = 1800
      + timeout_migrate                      = 1800
      + timeout_move_disk                    = 1800
      + timeout_reboot                       = 1800
      + timeout_shutdown_vm                  = 1800
      + timeout_start_vm                     = 1800
      + timeout_stop_vm                      = 300
      + vm_id                                = 7411

      + agent {
          + enabled = true
          + timeout = "15m"
          + trim    = false
          + type    = "virtio"
        }

      + cdrom {
          + enabled   = false
          + file_id   = (known after apply)
          + interface = "ide2"
        }

      + cpu {
          + cores      = 2
          + hotplugged = 0
          + limit      = 0
          + numa       = false
          + sockets    = 1
          + type       = "x86-64-v3"
          + units      = (known after apply)
        }

      + disk {
          + aio               = "io_uring"
          + backup            = true
          + cache             = "none"
          + datastore_id      = "local-lvm"
          + discard           = "ignore"
          + file_format       = "raw"
          + interface         = "scsi0"
          + iothread          = true
          + path_in_datastore = (known after apply)
          + replicate         = true
          + size              = 32
          + ssd               = false
        }

      + memory {
          + dedicated      = 4096
          + floating       = 4096
          + keep_hugepages = false
          + shared         = 0
        }

      + network_device {
          + bridge      = "vmbr0"
          + enabled     = true
          + firewall    = true
          + mac_address = "bc:24:11:d0:74:11"
          + model       = "virtio"
          + mtu         = 1
          + queues      = 16
          + rate_limit  = 0
          + vlan_id     = 0
        }

      + operating_system {
          + type = "l26"
        }

      + vga (known after apply)
    }

  # module.cluster.module.talos-vm["tiles-test-cp"].talos_machine_configuration_apply.this[0] will be created
  + resource "talos_machine_configuration_apply" "this" {
      + apply_mode                  = "auto"
      + client_configuration        = (sensitive value)
      + endpoint                    = "10.0.192.11"
      + id                          = (known after apply)
      + machine_configuration       = (sensitive value)
      + machine_configuration_input = (sensitive value)
      + node                        = "10.0.192.11"
    }

  # module.cluster.module.talos-vm["tiles-test-cp"].unifi_user.vm_client will be created
  + resource "unifi_user" "vm_client" {
      + allow_existing         = true
      + fixed_ip               = "10.0.192.11"
      + hostname               = (known after apply)
      + id                     = (known after apply)
      + ip                     = (known after apply)
      + local_dns_record       = "tiles-test-cp.local.symmatree.com."
      + mac                    = "bc:24:11:d0:74:11"
      + name                   = "tiles-test-cp"
      + note                   = "Control - 7411 - tiles-test-cp"
      + site                   = (known after apply)
      + skip_forget_on_destroy = false
    }

  # module.cluster.module.talos-vm["tiles-test-wk"].proxmox_virtual_environment_vm.main will be created
  + resource "proxmox_virtual_environment_vm" "main" {
      + acpi                                 = true
      + bios                                 = "seabios"
      + boot_order                           = (known after apply)
      + delete_unreferenced_disks_on_destroy = true
      + description                          = "Worker - 7421 - tiles-test-wk - 10.0.192.21"
      + id                                   = (known after apply)
      + ipv4_addresses                       = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + keyboard_layout                      = "en-us"
      + mac_addresses                        = (known after apply)
      + migrate                              = false
      + name                                 = "tiles-test-wk"
      + network_interface_names              = (known after apply)
      + node_name                            = "nuc-g3p-2"
      + on_boot                              = true
      + protection                           = false
      + purge_on_destroy                     = true
      + reboot                               = false
      + reboot_after_update                  = true
      + scsi_hardware                        = "virtio-scsi-single"
      + started                              = true
      + stop_on_destroy                      = false
      + tablet_device                        = true
      + tags                                 = []
      + template                             = false
      + timeout_clone                        = 1800
      + timeout_create                       = 1800
      + timeout_migrate                      = 1800
      + timeout_move_disk                    = 1800
      + timeout_reboot                       = 1800
      + timeout_shutdown_vm                  = 1800
      + timeout_start_vm                     = 1800
      + timeout_stop_vm                      = 300
      + vm_id                                = 7421

      + agent {
          + enabled = true
          + timeout = "15m"
          + trim    = false
          + type    = "virtio"
        }

      + cdrom {
          + enabled   = false
          + file_id   = (known after apply)
          + interface = "ide2"
        }

      + cpu {
          + cores      = 2
          + hotplugged = 0
          + limit      = 0
          + numa       = false
          + sockets    = 1
          + type       = "x86-64-v3"
          + units      = (known after apply)
        }

      + disk {
          + aio               = "io_uring"
          + backup            = true
          + cache             = "none"
          + datastore_id      = "local-lvm"
          + discard           = "ignore"
          + file_format       = "raw"
          + interface         = "scsi0"
          + iothread          = true
          + path_in_datastore = (known after apply)
          + replicate         = true
          + size              = 32
          + ssd               = false
        }

      + memory {
          + dedicated      = 8192
          + floating       = 8192
          + keep_hugepages = false
          + shared         = 0
        }

      + network_device {
          + bridge      = "vmbr0"
          + enabled     = true
          + firewall    = true
          + mac_address = "bc:24:11:d0:74:21"
          + model       = "virtio"
          + mtu         = 1
          + queues      = 16
          + rate_limit  = 0
          + vlan_id     = 0
        }

      + operating_system {
          + type = "l26"
        }

      + vga (known after apply)
    }

  # module.cluster.module.talos-vm["tiles-test-wk"].talos_machine_configuration_apply.this[0] will be created
  + resource "talos_machine_configuration_apply" "this" {
      + apply_mode                  = "auto"
      + client_configuration        = (sensitive value)
      + endpoint                    = "10.0.192.21"
      + id                          = (known after apply)
      + machine_configuration       = (sensitive value)
      + machine_configuration_input = (sensitive value)
      + node                        = "10.0.192.21"
    }

  # module.cluster.module.talos-vm["tiles-test-wk"].unifi_user.vm_client will be created
  + resource "unifi_user" "vm_client" {
      + allow_existing         = true
      + fixed_ip               = "10.0.192.21"
      + hostname               = (known after apply)
      + id                     = (known after apply)
      + ip                     = (known after apply)
      + local_dns_record       = "tiles-test-wk.local.symmatree.com."
      + mac                    = "bc:24:11:d0:74:21"
      + name                   = "tiles-test-wk"
      + note                   = "Worker - 7421 - tiles-test-wk"
      + site                   = (known after apply)
      + skip_forget_on_destroy = false
    }

  # module.cluster.module.k8s.module.dns-public-zone.google_dns_managed_zone.public[0] will be created
  + resource "google_dns_managed_zone" "public" {
      + creation_time    = (known after apply)
      + description      = "Managed by Terraform"
      + dns_name         = "tiles-test.symmatree.com."
      + effective_labels = {
          + "cluster"                    = "tiles-test"
          + "goog-terraform-provisioned" = "true"
          + "name"                       = "tiles-test"
        }
      + force_destroy    = false
      + id               = (known after apply)
      + labels           = {
          + "cluster" = "tiles-test"
          + "name"    = "tiles-test"
        }
      + managed_zone_id  = (known after apply)
      + name             = "tiles-test"
      + name_servers     = (known after apply)
      + project          = "symm-custodes"
      + terraform_labels = {
          + "cluster"                    = "tiles-test"
          + "goog-terraform-provisioned" = "true"
          + "name"                       = "tiles-test"
        }
      + visibility       = "public"

      + cloud_logging_config {
          + enable_logging = false
        }

      + dnssec_config (known after apply)
    }

  # module.cluster.module.k8s.module.dns-public-zone.google_dns_record_set.cloud-static-records["/NS"] will be created
  + resource "google_dns_record_set" "cloud-static-records" {
      + id           = (known after apply)
      + managed_zone = "tiles-test"
      + name         = "tiles-test.symmatree.com."
      + project      = "symm-custodes"
      + rrdatas      = [
          + "ns.tiles-test.symmatree.com.",
        ]
      + ttl          = 300
      + type         = "NS"
    }

  # module.cluster.module.k8s.module.dns-public-zone.google_dns_record_set.cloud-static-records["localhost/A"] will be created
  + resource "google_dns_record_set" "cloud-static-records" {
      + id           = (known after apply)
      + managed_zone = "tiles-test"
      + name         = "localhost.tiles-test.symmatree.com."
      + project      = "symm-custodes"
      + rrdatas      = [
          + "127.0.0.1",
        ]
      + ttl          = 300
      + type         = "A"
    }

  # module.cluster.module.k8s.module.dns-public-zone.google_dns_record_set.cloud-static-records["ns/A"] will be created
  + resource "google_dns_record_set" "cloud-static-records" {
      + id           = (known after apply)
      + managed_zone = "tiles-test"
      + name         = "ns.tiles-test.symmatree.com."
      + project      = "symm-custodes"
      + rrdatas      = [
          + "127.0.0.1",
        ]
      + ttl          = 300
      + type         = "A"
    }

  # module.cluster.module.k8s.module.loki_buckets.google_storage_bucket.buckets["admin"] will be created
  + resource "google_storage_bucket" "buckets" {
      + default_event_based_hold    = false
      + effective_labels            = {
          + "goog-terraform-provisioned" = "true"
          + "name"                       = "tiles-test-loki-admin"
        }
      + force_destroy               = false
      + id                          = (known after apply)
      + labels                      = {
          + "name" = "tiles-test-loki-admin"
        }
      + location                    = "US-EAST1"
      + name                        = "tiles-test-loki-admin"
      + project                     = "symm-custodes"
      + project_number              = (known after apply)
      + public_access_prevention    = "inherited"
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "goog-terraform-provisioned" = "true"
          + "name"                       = "tiles-test-loki-admin"
        }
      + time_created                = (known after apply)
      + uniform_bucket_level_access = true
      + updated                     = (known after apply)
      + url                         = (known after apply)

      + autoclass {
          + enabled                = false
          + terminal_storage_class = (known after apply)
        }

      + encryption (known after apply)

      + hierarchical_namespace {
          + enabled = false
        }

      + soft_delete_policy {
          + effective_time             = (known after apply)
          + retention_duration_seconds = 604800
        }

      + versioning {
          + enabled = true
        }

      + website (known after apply)
    }

  # module.cluster.module.k8s.module.loki_buckets.google_storage_bucket.buckets["chunks"] will be created
  + resource "google_storage_bucket" "buckets" {
      + default_event_based_hold    = false
      + effective_labels            = {
          + "goog-terraform-provisioned" = "true"
          + "name"                       = "tiles-test-loki-chunks"
        }
      + force_destroy               = false
      + id                          = (known after apply)
      + labels                      = {
          + "name" = "tiles-test-loki-chunks"
        }
      + location                    = "US-EAST1"
      + name                        = "tiles-test-loki-chunks"
      + project                     = "symm-custodes"
      + project_number              = (known after apply)
      + public_access_prevention    = "inherited"
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "goog-terraform-provisioned" = "true"
          + "name"                       = "tiles-test-loki-chunks"
        }
      + time_created                = (known after apply)
      + uniform_bucket_level_access = true
      + updated                     = (known after apply)
      + url                         = (known after apply)

      + autoclass {
          + enabled                = false
          + terminal_storage_class = (known after apply)
        }

      + encryption (known after apply)

      + hierarchical_namespace {
          + enabled = false
        }

      + soft_delete_policy {
          + effective_time             = (known after apply)
          + retention_duration_seconds = 604800
        }

      + versioning {
          + enabled = false
        }

      + website (known after apply)
    }

  # module.cluster.module.k8s.module.loki_buckets.google_storage_bucket.buckets["ruler"] will be created
  + resource "google_storage_bucket" "buckets" {
      + default_event_based_hold    = false
      + effective_labels            = {
          + "goog-terraform-provisioned" = "true"
          + "name"                       = "tiles-test-loki-ruler"
        }
      + force_destroy               = false
      + id                          = (known after apply)
      + labels                      = {
          + "name" = "tiles-test-loki-ruler"
        }
      + location                    = "US-EAST1"
      + name                        = "tiles-test-loki-ruler"
      + project                     = "symm-custodes"
      + project_number              = (known after apply)
      + public_access_prevention    = "inherited"
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "goog-terraform-provisioned" = "true"
          + "name"                       = "tiles-test-loki-ruler"
        }
      + time_created                = (known after apply)
      + uniform_bucket_level_access = true
      + updated                     = (known after apply)
      + url                         = (known after apply)

      + autoclass {
          + enabled                = false
          + terminal_storage_class = (known after apply)
        }

      + encryption (known after apply)

      + hierarchical_namespace {
          + enabled = false
        }

      + soft_delete_policy {
          + effective_time             = (known after apply)
          + retention_duration_seconds = 604800
        }

      + versioning {
          + enabled = true
        }

      + website (known after apply)
    }

  # module.cluster.module.k8s.module.loki_buckets.google_storage_bucket_iam_binding.admins["admin"] will be created
  + resource "google_storage_bucket_iam_binding" "admins" {
      + bucket  = "tiles-test-loki-admin"
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:tiles-test-loki@symm-custodes.iam.gserviceaccount.com",
        ]
      + role    = "roles/storage.objectAdmin"
    }

  # module.cluster.module.k8s.module.loki_buckets.google_storage_bucket_iam_binding.admins["chunks"] will be created
  + resource "google_storage_bucket_iam_binding" "admins" {
      + bucket  = "tiles-test-loki-chunks"
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:tiles-test-loki@symm-custodes.iam.gserviceaccount.com",
        ]
      + role    = "roles/storage.objectAdmin"
    }

  # module.cluster.module.k8s.module.loki_buckets.google_storage_bucket_iam_binding.admins["ruler"] will be created
  + resource "google_storage_bucket_iam_binding" "admins" {
      + bucket  = "tiles-test-loki-ruler"
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:tiles-test-loki@symm-custodes.iam.gserviceaccount.com",
        ]
      + role    = "roles/storage.objectAdmin"
    }

  # module.cluster.module.k8s.module.loki_encryption_key.google_kms_crypto_key.key[0] will be created
  + resource "google_kms_crypto_key" "key" {
      + crypto_key_backend            = (known after apply)
      + destroy_scheduled_duration    = (known after apply)
      + effective_labels              = {
          + "goog-terraform-provisioned" = "true"
        }
      + id                            = (known after apply)
      + import_only                   = false
      + key_ring                      = (known after apply)
      + name                          = "loki-storage"
      + primary                       = (known after apply)
      + purpose                       = "ENCRYPT_DECRYPT"
      + rotation_period               = "7776000s"
      + skip_initial_version_creation = false
      + terraform_labels              = {
          + "goog-terraform-provisioned" = "true"
        }

      + version_template {
          + algorithm        = "GOOGLE_SYMMETRIC_ENCRYPTION"
          + protection_level = "SOFTWARE"
        }
    }

  # module.cluster.module.k8s.module.loki_encryption_key.google_kms_crypto_key_iam_binding.decrypters[0] will be created
  + resource "google_kms_crypto_key_iam_binding" "decrypters" {
      + crypto_key_id = (known after apply)
      + etag          = (known after apply)
      + id            = (known after apply)
      + members       = [
          + "serviceAccount:service-989434133598@gs-project-accounts.iam.gserviceaccount.com",
        ]
      + role          = "roles/cloudkms.cryptoKeyDecrypter"
    }

  # module.cluster.module.k8s.module.loki_encryption_key.google_kms_crypto_key_iam_binding.encrypters[0] will be created
  + resource "google_kms_crypto_key_iam_binding" "encrypters" {
      + crypto_key_id = (known after apply)
      + etag          = (known after apply)
      + id            = (known after apply)
      + members       = [
          + "serviceAccount:service-989434133598@gs-project-accounts.iam.gserviceaccount.com",
        ]
      + role          = "roles/cloudkms.cryptoKeyEncrypter"
    }

  # module.cluster.module.k8s.module.loki_encryption_key.google_kms_crypto_key_iam_binding.owners[0] will be created
  + resource "google_kms_crypto_key_iam_binding" "owners" {
      + crypto_key_id = (known after apply)
      + etag          = (known after apply)
      + id            = (known after apply)
      + members       = [
          + "serviceAccount:tiles-tf-sa@symm-custodes.iam.gserviceaccount.com",
        ]
      + role          = "roles/owner"
    }

  # module.cluster.module.k8s.module.loki_encryption_key.google_kms_key_ring.key_ring will be created
  + resource "google_kms_key_ring" "key_ring" {
      + id       = (known after apply)
      + location = "us-east1"
      + name     = "tiles-test-loki"
      + project  = "symm-custodes"
    }

  # module.cluster.module.k8s.module.mimir_buckets.google_storage_bucket.buckets["alertmanager"] will be created
  + resource "google_storage_bucket" "buckets" {
      + default_event_based_hold    = false
      + effective_labels            = {
          + "goog-terraform-provisioned" = "true"
          + "name"                       = "tiles-test-mimir-alertmanager"
        }
      + force_destroy               = false
      + id                          = (known after apply)
      + labels                      = {
          + "name" = "tiles-test-mimir-alertmanager"
        }
      + location                    = "US-EAST1"
      + name                        = "tiles-test-mimir-alertmanager"
      + project                     = "symm-custodes"
      + project_number              = (known after apply)
      + public_access_prevention    = "inherited"
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "goog-terraform-provisioned" = "true"
          + "name"                       = "tiles-test-mimir-alertmanager"
        }
      + time_created                = (known after apply)
      + uniform_bucket_level_access = true
      + updated                     = (known after apply)
      + url                         = (known after apply)

      + autoclass {
          + enabled                = false
          + terminal_storage_class = (known after apply)
        }

      + encryption (known after apply)

      + hierarchical_namespace {
          + enabled = false
        }

      + soft_delete_policy {
          + effective_time             = (known after apply)
          + retention_duration_seconds = 604800
        }

      + versioning {
          + enabled = true
        }

      + website (known after apply)
    }

  # module.cluster.module.k8s.module.mimir_buckets.google_storage_bucket.buckets["blocks"] will be created
  + resource "google_storage_bucket" "buckets" {
      + default_event_based_hold    = false
      + effective_labels            = {
          + "goog-terraform-provisioned" = "true"
          + "name"                       = "tiles-test-mimir-blocks"
        }
      + force_destroy               = false
      + id                          = (known after apply)
      + labels                      = {
          + "name" = "tiles-test-mimir-blocks"
        }
      + location                    = "US-EAST1"
      + name                        = "tiles-test-mimir-blocks"
      + project                     = "symm-custodes"
      + project_number              = (known after apply)
      + public_access_prevention    = "inherited"
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "goog-terraform-provisioned" = "true"
          + "name"                       = "tiles-test-mimir-blocks"
        }
      + time_created                = (known after apply)
      + uniform_bucket_level_access = true
      + updated                     = (known after apply)
      + url                         = (known after apply)

      + autoclass {
          + enabled                = false
          + terminal_storage_class = (known after apply)
        }

      + encryption (known after apply)

      + hierarchical_namespace {
          + enabled = false
        }

      + soft_delete_policy {
          + effective_time             = (known after apply)
          + retention_duration_seconds = 604800
        }

      + versioning {
          + enabled = false
        }

      + website (known after apply)
    }

  # module.cluster.module.k8s.module.mimir_buckets.google_storage_bucket.buckets["ruler"] will be created
  + resource "google_storage_bucket" "buckets" {
      + default_event_based_hold    = false
      + effective_labels            = {
          + "goog-terraform-provisioned" = "true"
          + "name"                       = "tiles-test-mimir-ruler"
        }
      + force_destroy               = false
      + id                          = (known after apply)
      + labels                      = {
          + "name" = "tiles-test-mimir-ruler"
        }
      + location                    = "US-EAST1"
      + name                        = "tiles-test-mimir-ruler"
      + project                     = "symm-custodes"
      + project_number              = (known after apply)
      + public_access_prevention    = "inherited"
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "goog-terraform-provisioned" = "true"
          + "name"                       = "tiles-test-mimir-ruler"
        }
      + time_created                = (known after apply)
      + uniform_bucket_level_access = true
      + updated                     = (known after apply)
      + url                         = (known after apply)

      + autoclass {
          + enabled                = false
          + terminal_storage_class = (known after apply)
        }

      + encryption (known after apply)

      + hierarchical_namespace {
          + enabled = false
        }

      + soft_delete_policy {
          + effective_time             = (known after apply)
          + retention_duration_seconds = 604800
        }

      + versioning {
          + enabled = true
        }

      + website (known after apply)
    }

  # module.cluster.module.k8s.module.mimir_buckets.google_storage_bucket_iam_binding.admins["alertmanager"] will be created
  + resource "google_storage_bucket_iam_binding" "admins" {
      + bucket  = "tiles-test-mimir-alertmanager"
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:tiles-test-mimir@symm-custodes.iam.gserviceaccount.com",
        ]
      + role    = "roles/storage.objectAdmin"
    }

  # module.cluster.module.k8s.module.mimir_buckets.google_storage_bucket_iam_binding.admins["blocks"] will be created
  + resource "google_storage_bucket_iam_binding" "admins" {
      + bucket  = "tiles-test-mimir-blocks"
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:tiles-test-mimir@symm-custodes.iam.gserviceaccount.com",
        ]
      + role    = "r ...
  ```

  </details>
  Output is too long and was truncated. You can read full Plan in <a href="https://github.com/symmatree/tiles/actions/runs/20010685341">Actions</a>.<br /><br />
  